#+STARTUP: content

*** DONE SLD sensor model summary
    CLOSED: [2020-07-02 Thu 18:49]
    :PROPERTIES:
    :ID:       5876BFF9-635A-4FC5-ACB6-ED8B1801633A
    :END:
    :LOGBOOK:
    CLOCK: [2020-03-13 Fri 22:16]--[2020-07-02 Thu 17:38] => 2659:22
    :END:
  [2020-03-13 Fri 22:16]
  According to GK's instruments and my plan, make a survey about the existing SLD sensor of the *shape*, *principle*, *evaluation*, and *improvement* for our sensor.

***** DONE 修改论文实验部分
      CLOSED: [2020-08-06 Thu 10:52] DEADLINE: <2020-08-04 Tue 11:30> SCHEDULED: <2020-08-04 Tue 10:30>
      :LOGBOOK:
      CLOCK: [2020-08-04 Tue 10:30]--[2020-08-04 Tue 11:41] =>  1:11
      :END:

**** DONE 画图
     CLOSED: [2020-08-10 Mon 09:08]
     :LOGBOOK:
     CLOCK: [2020-08-10 Mon 08:30]--[2020-08-10 Mon 09:08] =>  0:38
     :END:
 原始数据经过卡尔曼滤波之后，画图。

 关于原始数据滤波之后，是否算作篡改数据，这事再讨论。

**** DONE 冰厚问题
     CLOSED: [2020-08-03 Mon 11:21] SCHEDULED: <2020-08-03 Mon 10:00>
     :LOGBOOK:
     CLOCK: [2020-08-03 Mon 10:57]--[2020-08-03 Mon 11:21] =>  0:24
     CLOCK: [2020-08-03 Mon 10:02]--[2020-08-03 Mon 10:13] =>  0:11
     :END:
 究竟什么才是有用的数据？
 不同时间的厚度 vs 最终的结冰厚度
 结冰分布 vs 结冰厚度

 不同时间的冰厚，也就是传感器输出，只是可以从侧面表述，结冰的分布范围

 最终的冰厚，也就是图片识别的冰厚，可以和仿真进行比较。

 经过讨论，混合光纤对冰厚敏感，可作为开关变量，单独的接受光纤，可作为冰厚探测

***** tangent

 #+CAPTION: ratio
 | radius1 | radius2 |         inner ratio |     external ratio |
 |     3.0 |     5.5 | 0.35294117647058826 | 2.8333333333333335 |
 |     5.5 |     7.0 |                0.44 |  2.272727272727273 |
 |     7.0 |    10.0 |  0.4117647058823529 | 2.4285714285714284 |
 |    10.0 |     3.0 |  0.7692307692307693 |                1.3 |
 #+TBLFM: @2$3..@5$3='(/ $1 (+ $1 $2));N::@2$4..@5$4='(/ (+ $1 $2) $1);N

*** DONE Experimental Data Process
    CLOSED: [2020-07-02 Thu 18:49]
    :LOGBOOK:
    CLOCK: [2020-04-04 Sat 15:19]--[2020-04-04 Sat 16:49] =>  1:30
    :END:
  [2020-04-04 Sat 15:19]

**** latex template usage

     1. clone repo to [[/Users/xin/Downloads/hustthesis/][local]]
        #+begin_src shell
          cd ~/Downloads && git clone https://github.com/hust-latex/hustthesis.git
          cd hustthesis
          ls
        #+end_src
     2. mv cls file
        #+begin_src shell
          cd ~/Downloads/hustthesis/
          make unpack
          cp hustthesis/makefile /Users/xin/Documents/Ice/GP/latex
          cp hustthesis/hustthesis.bst /Users/xin/Documents/Ice/GP/latex
          cp hustthesis/hustthesis.cls /Users/xin/Documents/Ice/GP/latex
          cp hustthesis/hust-title.eps /Users/xin/Documents/Ice/GP/latex
          cp hustthesis/hust-title.pdf /Users/xin/Documents/Ice/GP/latex
        #+end_src

        #+RESULTS:
        : make -C ./hustthesis unpack
     3. [[/Users/xin/Documents/Ice/GP/latex/][demo]]
        #+begin_src shell
          cp ~/Downloads/hustthesis/hustthesis/hustthesis-zh-example.tex ~/Documents/Ice/GP/latex/demo.tex
          cp ~/Downloads/hustthesis/hustthesis/ref-example.bib ~/Documents/Ice/GP/latex/ref.bib
        #+end_src

        #+RESULTS:
     4. compile and view
        [[/Users/xin/Documents/Ice/GP/latex/][demo]]

*** NEXT 摘要
    :LOGBOOK:
    CLOCK: [2021-02-24 Wed 09:32]--[2021-02-24 Wed 09:42] =>  0:10
    :END:

   论文名称：光纤式飞机结冰探测

   结冰条件（温度、液态水含量、水滴粒径、风速），结冰（空隙率、结冰速率），光纤传感器（电压变化、温度变化、电压冰厚曲线）

   种类更多的冰型（传感器数据处理的主要问题是：对应的电压温度-时间曲线，不能够自动分辨冰型），是由人为控制实验条件实现的，冰型的传感器数据可以认为已经在记录时和冰型对应了。
   通过 svr 变为 *电压-冰厚曲线* ，再区分这些曲线的不同，证明冰型不同。

   冰型和试验条件的联系也不讨论，那么，冰型的区分，就要基于光纤特性（不能基于空隙率，因为不可测），目前考虑的是透光率（外界光直射时接受光的比例）。

   因此，本文的重心就是识别冰型。
**** 研究背景
     :LOGBOOK:
     CLOCK: [2021-02-24 Wed 09:42]--[2021-02-24 Wed 10:26] =>  0:44
     :END:

    工程背景+学术背景+学术问题+经济型研究
    - 在什么环境下有了这么个研究点：工程背景（飞机安全），学术背景（光纤结冰探测提高精度）
    - 为什么要研究这个问题：为什么做这项研究，是时代发展至此，需要考虑这个问题，还是 *以前存在未解决的问题*
    - 符合文章结构：飞机结冰危险---冰的光学性质研究取得进展---光纤探测稳定---新的问题是冰型影响光强---对冰进行更细分类并测量冰厚
    - 设定目前问题的结构：是什么 1，结冰怎么产生的 2，为什么要检测 3，怎么避免 4
**** DONE 结冰类型与外观
     CLOSED: [2021-02-24 Wed 19:10]
     :LOGBOOK:
     CLOCK: [2021-02-24 Wed 10:41]--[2021-02-24 Wed 11:54] =>  1:13
     :END:

      将 5 种气象条件归纳到 SLD 的包线中，并作为后续讨论结冰条件的约定。

      note: 过冷水滴不能放在开头
**** 国内外研究现状
     :LOGBOOK:
     CLOCK: [2021-02-24 Wed 19:11]--[2021-02-24 Wed 20:57] =>  1:46
     :END:
     国外需要分开写?当需要突出国内的研究落后于国外，可以。但不强制这样

     文献对比，结果放表格
     各项研究的进展与问题
     过于发散，关注于自己的问题

     结冰仿真简略写，冰风洞在试验部分写，冰的微观结构在原理部分写，主要写结冰探测和光纤探测
**** 研究目的及意义
     :LOGBOOK:
     CLOCK: [2021-02-24 Wed 21:30]--[2021-02-24 Wed 21:55] =>  0:25
     :END:
**** 引言
     :LOGBOOK:
     CLOCK: [2021-02-25 Thu 10:20]--[2021-02-25 Thu 10:45] =>  0:25
     :END:
     光纤式结冰传感器通常基于冰层的光学调制特性，接收并测量调制光的变化，对应冰层的变化。
     入射到冰层中的光，在冰的多空隙作用下发生散射、反射、折射等现象，其光强、相位、波长都会发生变化。
     本文采用的是光强式光纤结冰探测，发射光纤和结冰光纤在冰层的同侧，具有结构简单、性能稳定、设计灵活、价格低廉、灵敏度高的优点，反射光强信号稳定且一致性高，测量反射光强的变化，可以计算得到冰厚的变化。

     为了深入理解光在冰中的物理行为及发射接收光线的传输行为，建立了光纤的几何光学传输模型和冰的光学调制模型，从菲涅尔公式出发，得到光在光纤－冰层界面、冰层－气泡界面、冰层－空气界面处的能反射进入接收光纤的光强，在接收面积分即可得到传感器探测得到的反射光强。
     为了验证该模型的有效性，使用 COMSOL 有限元仿真工具，对光纤式结冰传感器进行了几何光学的仿真，结果表明，仿真的反射光强随冰厚的冰厚趋势，和模型的结论基本一致，证明了模型的有效型。
     以上两个模型，可以帮助相关科研工作者省去不必要的试验，并能直观地根据仿真结果指导传感器地设计和验证。

****** 折射率虚部
       :LOGBOOK:
       CLOCK: [2021-02-25 Thu 12:33]--[2021-02-25 Thu 12:58] =>  0:25
       CLOCK: [2021-02-25 Thu 15:10]--[2021-02-25 Thu 17:35] =>  2:25
       :END:

     光在传输的过程中，光强会逐渐衰减；在不同物质的界面处，根据入射角度和折射率的不同，反射和透射的光强也会发生突变。

     不同介质的折射率可以描述为：$n=\frac{c}{v}=\sqrt{u_r\eplison_4}$。

     复折射率可以表示为$n=n_r+in_i$，假设一单色平面波，真空中电场表示为 $E(t,x)=Ae^{-i(wt-kx)}$ ，
     当进入介质中时，波矢 k 变成 nk，此时， $E(t,x)=Ae^{-n_ikx}e^{-i(wt-n_rkx)}$ ，其中$n_i$ 引入了一个指数衰减因子。
     虚部对应的物理意义就是振幅随传播衰减，也就是介质会对波有吸收。

     比尔朗伯定律描述了光在均匀非散射吸光物质中被吸收的程度，与物质浓度、物质厚度有关。

     桂博博士论文42页。
     在界面处，菲涅尔方程详细地描述了，折射光和透射光占入射光的比例。
     当光入射到不同介质的界面处时，光可以分解为两束正交偏振光的组合，其中S偏振光是电场垂直于入射平面磁场在入射平面内的光分量，而P偏振光是正交于S偏振光的光分量。
     其中，反射光的比例可以描述为：$$ ,
     透射光的比例可以描述为：$$ ,这分别对应于电矢量反射率和折射率。

     目前常见的光强探测的有效值是光功率而非光强或光电矢量。
     光功率是光强I与有效面积S的向量点积。$W=I\cdot S$，反射光和透射光的光功率可以描述为：

     通过光纤的传输方程和光功率方程，可以准确描述任一光线在传输过程的位置和能量大小。

**** 冰的光电特性
     :LOGBOOK:
     CLOCK: [2021-02-25 Thu 20:56]--[2021-02-25 Thu 21:02] =>  0:06
     CLOCK: [2021-02-25 Thu 20:18]--[2021-02-25 Thu 20:43] =>  0:25
     CLOCK: [2021-02-25 Thu 19:39]--[2021-02-25 Thu 20:04] =>  0:25
     CLOCK: [2021-02-25 Thu 19:08]--[2021-02-25 Thu 19:33] =>  0:25
     :END:
     入射进入冰层的光，在冰晶中沿直线传播，光强逐渐衰减。在不同物质的界面处，光会发生散射、透射、折射、反射等一些列行为，光的传播方向和光强大小会发生突变。
     自然界的冰和飞机航行过程结的冰，内部结构复杂，在之前的研究中，把冰简化为折射率为1.3的纯净物进行分析，这样的化简过于极端，忽略了冰内部复杂的物质组成和形体结构。

     本文根据目前对冰表面结构和三维空隙结构的最新研究，重新对冰进行几何建模，加入了随机分布的空隙和杂质颗粒，并对冰表面进行了粗糙处理。
     冰层更复杂的内部结构，光电特性也更加丰富。
***** 表面粗糙度
      :LOGBOOK:
      CLOCK: [2021-02-25 Thu 21:52]--[2021-02-25 Thu 22:17] =>  0:25
      :END:
      反射和漫反射的光传输方程

      不同介质的界面如果是平滑的，光强和光传播方向可以按照菲涅尔方程定量计算得到。
      但从实际飞机航行过程中拍照的图片看，冰层表面非常不规则。
      在冰层生长的过程中，如果是光滑的明冰，表面会有不规则的角状突起，如果是淞冰，表面呈羽毛状。具体形状如下图所示。

      由于冰层表面不规则，光到达界面处，折射和反射没有一致性，凹凸不平的表面导致光的入射角不同，因此可认为光在表面发生漫反射，向各个方向无规则反射。
      反射光强的计算则更加复杂，因为漫反射的反射光强是和表面粗糙度相关，冰层表面的不规则形状没有明确定义的不规则度。
      在本文中，把冰层表面看作是由正弦曲线组成的，表面的粗糙度是正弦曲线的长度。
      这样既可以定量表示冰层表面的不规则凹凸，也可以通过有限元法，计算处反射光的方向和强度。

**** 光纤结冰模型仿真
     :LOGBOOK:
     CLOCK: [2021-02-26 Fri 11:17]
     CLOCK: [2021-02-26 Fri 10:47]--[2021-02-26 Fri 11:12] =>  0:25
     CLOCK: [2021-02-26 Fri 10:13]--[2021-02-26 Fri 10:38] =>  0:25
     :END:
     验证公式正确性
     不同冰型的曲线变化趋势

     为了验证以上光纤结冰模型的正确性，使用商业软件 COMSOL 的几何光学仿真模块，对光纤结冰传感器进行了光路分析和光强仿真计算。
     使用 COMSOL 建模工具，建立和光纤混合二维模型和多空隙冰层模型，通过改变冰层厚度和空隙率得到冰层的光学调制曲线，通过改变光纤的排布，证明接收光纤的有效性。

